adafruit/seesaw/lib/samd21/samd21c/edc/ATSAMD21G15B.PIC
      <edc:AdjustPoint edc:_addr="0x41000008" edc:offset="0x1FF8"/>
      <edc:SFRDef edc:_addr="0x41002000" edc:access="---www-w" edc:cname="CTRL" edc:impl="0x1D" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="DSU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CRC" edc:desc="32-bit Cyclic Redundancy Check" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MBIST" edc:desc="Memory Built-In Self-Test" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CE" edc:desc="Chip Erase" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41002001" edc:access="---nnnnn" edc:cname="STATUSA" edc:impl="0x1F" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="DSU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="DONE" edc:desc="Done" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRSTEXT" edc:desc="CPU Reset Phase Extension" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BERR" edc:desc="Bus Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FAIL" edc:desc="Failure" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PERR" edc:desc="Protection Error" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41002002" edc:access="---rrrrr" edc:cname="STATUSB" edc:impl="0x1F" edc:mclr="00010000" edc:nzwidth="0x8" edc:por="00010000" ltx:memberofperipheral="DSU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="PROT" edc:desc="Protected" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DBGPRES" edc:desc="Debugger Present" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DCCD0" edc:desc="Debug Communication Channel 0 Dirty" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DCCD1" edc:desc="Debug Communication Channel 1 Dirty" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HPE" edc:desc="Hot-Plugging Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x41002003" edc:offset="0x1"/>
      <edc:SFRDef edc:_addr="0x41002004" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnn--" edc:cname="ADDR" edc:impl="0xFFFFFFFC" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DSU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ADDR" edc:desc="Address" edc:nzwidth="0x1E"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41002008" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnn--" edc:cname="LENGTH" edc:impl="0xFFFFFFFC" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DSU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="LENGTH" edc:desc="Length" edc:nzwidth="0x1E"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100200C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DATA" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DSU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41002010" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DCC0" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DSU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41002014" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DCC1" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DSU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41002018" edc:access="rrrrrrrrr-rrrrrrrrrrrrrrrrrrrrrr" edc:cname="DID" edc:impl="0xFFBFFFFF" edc:mclr="00010000000000010001010100100100" edc:nzwidth="0x20" edc:por="00010000000000010001010100100100" ltx:memberofperipheral="DSU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="DEVSEL" edc:desc="Device Select" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="REVISION" edc:desc="Revision" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="DIE" edc:desc="Die Identification" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="SERIES" edc:desc="Product Series" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FAMILY" edc:desc="Product Family" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="PROCESSOR" edc:desc="Processor" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
